import React from "react";

const Video = () => {
  return (
    <div className="video">
      <div className="wrapper">
        <p>
          Сотрудничаем со многими производственными, научными специалистами и
          научными институтами с/х направлениями.
        </p>
        <div className="playback-btn">
          <span>
            <svg
              width="14"
              height="16"
              viewBox="0 0 14 16"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M12.9231 5.88763C14.359 6.71665 14.359 8.78919 12.9231 9.6182L3.23077 15.2141C1.79487 16.0431 -7.24749e-08 15.0068 0 13.3488L4.89206e-07 2.15706C5.6168e-07 0.499026 1.79487 -0.537241 3.23077 0.291774L12.9231 5.88763Z"
                fill="white"
              />
            </svg>
          </span>
        </div>
        <div className="info">
          <p>
            Мы гарантируем Вам индивидуальные, профессиональный подход к решению
            задач по повышению конкурентоспособности Вашего предприятия
          </p>
          <div className="btn">
            Узнать больше
            <svg
              width="11"
              height="11"
              viewBox="0 0 11 11"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M10.552 1.55239L10.552 9.69562C10.552 9.819 10.529 9.92963 10.4829 10.0275C10.4364 10.125 10.3721 10.2149 10.2898 10.2971C10.2076 10.3794 10.1177 10.4437 10.0202 10.4902C9.92233 10.5363 9.8117 10.5593 9.68832 10.5593L1.54509 10.5593C1.31889 10.5593 1.11839 10.4772 0.943599 10.3131C0.768807 10.1482 0.681412 9.94238 0.681412 9.69562C0.67113 9.45914 0.748038 9.2535 0.912137 9.07871C1.07706 8.90392 1.2829 8.81652 1.52966 8.81652L7.5754 8.81652L0.681411 1.92254C0.50662 1.74774 0.419018 1.54211 0.418607 1.30562C0.419018 1.06914 0.50662 0.863504 0.681411 0.688713C0.856203 0.513921 1.06163 0.426526 1.29771 0.426526C1.5346 0.426526 1.74044 0.513921 1.91523 0.688713L8.80922 7.5827L8.80922 1.53697C8.80922 1.31077 8.89394 1.1076 9.06339 0.927458C9.23324 0.747731 9.43641 0.663009 9.67289 0.673291C9.90938 0.66301 10.115 0.745263 10.2898 0.920055C10.4646 1.09485 10.552 1.30563 10.552 1.55239Z"
                fill="white"
              />
            </svg>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Video;
